{"intents": [{"tag": "greeting", "patterns": ["Hi", "Hey", "How are you", "Is anyone there?", "Hello", "Good day"], "responses": ["Hey :-)", "Hello, thanks for visiting", "Hi there, what can I do for you?", "Hi there, how can I help?"]}, {"tag": "goodbye", "patterns": ["Bye", "See you later", "Goodbye"], "responses": ["See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon."]}, {"tag": "thanks", "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"], "responses": ["Happy to help!", "Any time!", "My pleasure"]}, {"tag": "medicalSchemeDefinition", "patterns": ["what is a medical scheme at RSSB?", "Is a medical scheme same as medical aid at RSSB?", "Why are RSSB medical schemes important?", "What are the types of medical offered at RSSB?", "how can have a membership of RSSB medical schemes", "Are private sectors permitted to join th scheme?", "how about pensioners, private institutions, public institutions and others"], "responses": ["The Medical Scheme has been in place since 2001. Membership is automatic for all public employees; the private sector can join the scheme if there is a payroll of 7 or more employees. Pensioner affiliates can join the scheme if they receive RSSB pension and previously contributed to the scheme. Coverage of the scheme extends to spouses and children of affiliates. More info: https://www.rssb.rw/scheme/medical-scheme", "Medical schemes, therefore, help you to pay for your healthcare needs, such as medical expenses related to doctor's visits, nursing, surgery, dental work, optometry, medicine and hospital accommodation when needed.you can find a link for more info:https://www.rssb.rw/scheme/medical-scheme", "What is it? A Medical Scheme Fees is a rebate which, in itself, is non-refundable, but which is used to reduce the normal price a person pays. Here is the link: https://www.rssb.rw/scheme/medical-scheme"]}, {"tag": "insuranceCostAndCoverage", "patterns": ["How much does the insurance cost is the scheme ?", "what is coverd in RSSB scheme?", "What are service paid by this scheme at RSSB?", "is medical check provided? how about medical care for RSSB membership?", "Are drugs, consultations, Surgical intervensions as well as dental care provided?", "What are laboratory servises, laboratory tests offered?"], "responses": ["RSSB also covers the medical insurance for pensioners with 7.5% contribution deducted from their monthly pension. The employer is responsible for deducting, declaring and paying their employee's contribution to RSSB. The contribution is deducted on a monthly basis and paid not later than the 10th day of the following month. More info: https://www.rssb.rw/scheme/medical-scheme", "RSSB covers 85% of the bill for medical treatment and prescribed drugs. Patients themselves cover the remaining 15% of the cost.you can find a link for more info:https://www.rssb.rw/scheme/medical-scheme", "RSSB covers the following medical care provision: Medical consultations,Drugs, including chemotherapy,Surgical interventions,Dental care including prosthesis,Medical imaging, including CT Scan & MRI,Laboratory tests,Physiotherapy, Hospitalization,Eye treatment including provision of lenses and frames,Lower / upper limb prosthesis & Orthesis, Dialysis, Full Medical check-up &nbsps. Here is the link: https://www.rssb.rw/scheme/medical-scheme", "The full medical checking is provided under conditions (35 years for women and 40 years for men). RSSB covers all medical acts and procedures, all laboratory and imaging investigations provided in Rwanda. &nbsps.Find alink for more info://www.rssb.rw/scheme/medical-scheme", "Please note that medical care is refundable by RSSB provided that the health facility has signed an agreement with RSSB. The Ministry of Health in collaboration with RSSB has agreed which medical procedures and drugs are to be refunded.more info: //www.rssb.rw/scheme/medical-scheme"]}, {"tag": "partnerships", "patterns": ["who is parternering with RSSB?", "Iwho are partners of  RSSB?", "how can I apply to be a partner?", "Becoming an Rssb partener?", "requirements to be an Rssb partener", "Can clinical services,Pharmaceutical,Workshops and private laboratory be partners?"], "responses": ["Pharmaceutical services.Paramedic services (optics and physiotherapy). Laboratory.Clinical services. Workshops making orthopedic appliance. More info: https://www.rssb.rw/scheme/medical-scheme", "Document with specific requirements as regarding each venture i.e. pharmaceutical, clinical and laboratory services is acquired from RSSB Head Offices and referred to in preparations for partnership.An application letter is written alongside a detailed proposal and addressed to the Director General.you can find a link for more info:https://www.rssb.rw/scheme/medical-scheme", "The Contracts Commission analyses the application and proposal.A site visit of the facility (Laboratory, clinic and pharmacy) is scheduled and conducted immediately. the basis of quality services and best facilities in accommodating or delivering quality services to RSSB beneficiaries.The last step is entering into an agreement with a more capable and efficient partner. Here is the link: https://www.rssb.rw/scheme/medical-scheme", "Pharmaceutical services.Paramedic services (optics and physiotherapy). Laboratory.Clinical services. Workshops making orthopedic appliance"]}, {"tag": "maternityLeave", "patterns": ["hat are the advantages of maternity_leave?", "What is a maternity leave?", "Are there any benefits while having maternity-leave?", "What about maternity leave?", "Tell me about childbirth recovery, prolonged maternity-leave"], "responses": ["Maternity Leave Benefits (MLB) insurance is a maternity protection scheme that grants working women (mothers) their full (100%) remuneration while on a 12 week maternity leave. More info: https://www.rssb.rw/scheme/maternity-leave", "Sufficient leave for pregnancy and childbirth recovery; exclusive breastfeeding for the baby’s health and development, attachment and care.you can find a link for more info:https://www.rssb.rw/scheme/maternity-leave", "Full salary; One additional month of benefits in case of delivery complications, necessitating prolonged maternity leave. Here is the link: https://www.rssb.rw/scheme/maternity-leave"]}, {"tag": "requirementsContribution", "patterns": ["what are the requirements or necessities to get maternity-leave?", "Eligibility requirements for maternity leave scheme?", "What are the contributions, donations of workers for maternity-leave scheme?"], "responses": ["All workers are governed by labour law, general statutes for public service or special statutes.0.6% of Gross salary,0.3% employer's share,0.3% employee's share.If an employee has more than one employer, each remits contributions.For more info:https://www.rssb.rw/scheme/maternity-leave.", "Must be on maternity leave.Must have contributed at least 1 month preceding the month in which maternity leave starts.Present a medical certificate of delivery.For more info:https://www.rssb.rw/scheme/maternity-leave"]}, {"tag": "matleaveBenefitPaidRembursement", "patterns": ["How do maternity leave benefits are paid?", "how can we receive those benefits?", "Where do you apply to get benefit paid and reimbursement of maternity_leave benefits?", "Request of reimbursement of maternity_leave benefits?", "How long it takes to get reimbursed for maternity-leave benefits", "how is Reimbursement Amount Calculated?"], "responses": ["The employer shall pay 12 weeks' wages. At end of period, the employer requests RSSB reimbursement for the last 6 weeks of maternity leave. ", "The request for reimbursement form shall be filled by the employer and accompanied by: Application for maternity leave benefits form signed by the woman who delivered.A copy of identity card/passport of the insured woman.A document from the employer stating that the woman was on maternity leave.Detailed pay slips related to the maternity leave period signed by both employee and employer and stamped and so on... find more info: https://www.rssb.rw/scheme/maternity-leave", "When to submit the request for benefits reimbursement Within 6 months from beginning of maternity leave.Reimbursement Deadline Within 30 days from reception date of reimbursement request.Her is the link: https://www.rssb.rw/scheme/maternity-leave to see more", "Reimbursement Amount Calculated based on last woman's salary during maternity leave to which the contribution was subscribed.Here is the link for more info: https://www.rssb.rw/scheme/maternity-leave"]}, {"tag": "pensionScheme", "patterns": ["what is pension scheme?", "can I know about pension scheme?", "I need much explanation about rssb pension scheme?", "what is really pension scheme and its impact on social security?", "tell me about what pension scheme can do."], "responses": [" Pension scheme is a scheme of social security which help workers who becomes old and incapable of working for a salary or becomes invalid and incapable of living by working. More info: https://www.rssb.rw/scheme/pension-scheme", "Pension scheme is a scheme of social security which help workers who becomes old and incapable of working for a salary or becomes invalid and incapable of living by working.you can find a link for more info:https:https://www.rssb.rw/scheme/pension-scheme", " The scheme helps also the survivors of the deceased worker. The Social Security benefits offered by under pensions scheme are: old age benefits, invalidity benefits, anticipated benefits and survivors' benefits. Here is the link: https://www.rssb.rw/scheme/pension-scheme"]}, {"tag": "pensionSchemeBenefits", "patterns": ["who can benefit the pension scheme?", "Who can be eligible for the pension scheme?", "Why are RSSB medical schemes important?", "What do you follow to offer pension scheme?", "what condition to be given a pension scheme?", "what it requires to be eligible for  pension scheme?"], "responses": ["To be at least sixty(60) years old or to be of the age provided for by legally recognized specific statutes.To have contributed to the pension scheme for at least fifteen ( 15) years.To have ceased to perform any remuneration activity. More info: https://www.rssb.rw/scheme/pension-scheme", "If an insured person becomes prematurely old and is certified so by a commission composed of recognized medical doctors established by the Minister in charge of health upon request by the employer or employee, he/she is entitled to early retirement.Find more here: https://www.rssb.rw/scheme/pension-scheme", "He/she must also have contributed for at least fifteen (15) years or To have ceased to perform any remunerated activity. Here is the link: https://www.rssb.rw/scheme/pension-scheme", "An insured that is eligible for early retirement pension benefits; but who did not contribute 15 years; he/she shall receive a lump-sum pension allowance. Additional info:https://www.rssb.rw/scheme/pension-scheme", "To have contributed up to six (6) months within a period of twelve (12) months before the date on which his/her disability is certified by a medical doctor. More info: https://www.rssb.rw/scheme/pension-scheme", "If, upon his/her request or upon the employer's request, the disability is certified by a recognized medical doctor and confirmed by medical officer for the public entity in charge of pension scheme. Find more here: https://www.rssb.rw/scheme/pension-scheme", "The surviving spouse who did not divorce the deceased. The deceased's biological or adoptive parent of the deceased. Link: https://www.rssb.rw/scheme/pension-scheme", "To have contributed for at least three (3) years.More info: https://www.rssb.rw/scheme/pension-scheme", "The legitimate orphans single, non employed and under eighteen (18) years of age or twenty-five (25) years of age if still studying. If they suffer from physical or mental disability certified by a recognized medical doctor which renders them unable to perform a remunerated activity shall receive pension benefits until they die.Use this link for more: https://www.rssb.rw/scheme/pension-scheme"]}, {"tag": "pensionSchemeRequirements", "patterns": ["what is required to get pension scheme at RSSB?", "Is is allowed to get a Survivors' pension", "what is the eligibility of old people to get their pension?", "Are The surviving spouse eligible for survivors'pension?", "what is a condition for I can get orphans single, non impoyed 's pension?", "Invalidity pension/Non occupational disability benefits, I need the process to get my pension", "I am old man, what it requires to declare my pension?"], "responses": ["Marriage certificate.Birth certificates for the deceased's surviving children.Certificate of guardianship issued by competent Tribunal in case of the absence or death of both the parents of the surviving children.Certificate of legal recognition of natural children.Certificate of school attendance issued by the Heads of schools for the children who are still at school from age of 18 to 25 years. see othr requirements:https://www.rssb.rw/scheme/pension-scheme.", "Certificate of invalidity issued by medical authority for children who are invalid. Certificate of bachelorhood or spinsterhood for the insured person who died single.Life certificates of the beneficiaries and 2 passport photos. Legal document for adoptive parents. Copy of identification card of the applicant.Other requirements: https://www.rssb.rw/scheme/pension-scheme.", "Certificate of your working capacity issued by the employer. Medical certificate of professional inaptitude issued by a doctor approved by the Government. Bank account number.More other requirements:https://www.rssb.rw/scheme/pension-scheme.", "commission Certificate of your working capacity issued by the employer .His /Her own Bank account Number opened in Rwanda and others: https://www.rssb.rw/scheme/pension-scheme"]}, {"tag": "mondatoryVoluntaryInsurance", "patterns": ["Can I join this insurance as an indivisual?", "I am a self employed person.Can I be eligible to apply for this pension scheme?", "My contribution was under mandatory scheme, I was unable to meet the same condition can I remain a member of this scheme?", "I am a salary workers, is it possible not to enroll for for your pension profit?", "Who is allowed to be a member in voluntary insurance?"], "responses": ["The Social Security benefits offered by the branch of pensions are therefore divided into two categories:Those given to the insured person himself when old or invalid.Those given to his eligible survivors. The contribution rates are 3% paid by the employer and 3% by the employee. To know more: https://www.rssb.rw/scheme/pension-scheme", "Enrolling for pension benefits is compulsory for the following individuals:All salaried workers (regardless of nationality). Active political representatives.", "Voluntary Insurance is when a person who is not subjected to social security by law decides to join the scheme as an individual. This can be achieved by applying to join the scheme and paying the required contributions of 6 % of the salary that he or she has fixed. The salary used as the basis for calculating the contribution shall not be less than the basic salary and may not exceed one hundred and thirty percent ( 130%) of the final salary used as the basis for calculating the contributions. This salary can not increase by more that thirty (30%) every three (3) years. Here is the link: https://www.rssb.rw/scheme/pension-scheme", "Any person who contributed under mandatory scheme and enable to continue meeting those conditions can voluntarily apply to remain a member of the scheme. Use this link to get more info: https://www.rssb.rw/scheme/pension-scheme", " The right to apply for voluntary insurance is also accorded to self-employed persons who have never been members of mandatory pension as long as they are not above 50 years of age. Find more here: https://www.rssb.rw/scheme/pension-scheme"]}, {"tag": "quest", "patterns": ["Why does RSSB not provide pension benefits to close relatives (sisters, brothers etc...) in case the contributor dies without leaving any child, spouse or parent?.", "In instances where beneficiaries benefit more that one pension benefits, why do you give them one and a half of the pension he is entitled on the second/or third file?"], "responses": ["The law provides beneficiaries of pension benefits in case the affiliate dies and these are restricted to spouses, orphans, and parents in case the deceased does not have a spouse or any child.More info:https://www.rssb.rw/scheme/pension-scheme", "Article 27 of the law No06/2003 of 22/03/2003 modifying the law of August 22, 1974 concerning organization of social security in Rwanda states that; “If the beneficiary has two or several pensions or allowances, he will receive the bigger amount plus, a half of the others. Nevertheless, the orphan of both parents is entitled to the totality of those social security benefits.find the link: https://www.rssb.rw/scheme/pension-scheme"]}, {"tag": "CBHIScheme", "patterns": ["what is Mutuelle de sante?", "what is the objectives of CBHI?", "who are the Beneficiaries of the Community Based Health Insurance scheme", "The aime and objectives of mituelle de sante", "Management of Community Based Health Insurance (CBHI) Mutuelle de sante"], "responses": ["From the 1st July 2015 the management of the Medical Insurance Scheme (CBHI) was moved from the Ministry of Health to Rwanda Social Security Board (RSSB). The move aimed at improving the fund's financial accountability and ensures quality health care for subscribers. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "Community Based Health Insurance (Mutuelle de santé) is a solidarity health insurance system in which persons (families) come together and pay contributions for the purpose of protection and receipt of medical care. It was established in order to help people with low income access medical care at affordable cost. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "The Community Based Health Insurance scheme offers healthcare coverage to household members if all of them have paid their respective contributions, with the exception of any member insured under any other medical insurance scheme.Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme", "It was established in order to help people with low income access medical care at affordable cost. Here is the link: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "categorypaymentcontrib", "patterns": ["what condition to make classification, or member categories?", "how do you make categories among mbembers?", "how payments is done bu beneficiaries?", "is contribution made according ubudehe categories", "Is there a way of goverment support for those whore unable to contribute?"], "responses": ["Ordinary Members. Honorary Members An ordinary member is any person enrolled into the Community-Based Health Insurance scheme who either personally or through a third party, pays an annual contribution. Honorary members are persons who provide support or donation without expecting any medical services or other benefits in return. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "Contribution is made depending on the Ubudehe category in which individuals are:Category I pays 2,000Frw per person and this category is supported by the Government and other donors.Category II pays 3,000Frw per person.Category III pays 7,000Frw per person The community-based health insurance scheme year starts on 1st July and end on 30th June of the following year. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "The Community Based Health Insurance scheme offers healthcare coverage to household members if all of them have paid their respective contributions, with the exception of any member insured under any other medical insurance scheme.Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme", "Note: Category I is supported by the Government and other donors, Payment Contributions is done online vis. Imirenge Sacco ( All).Mobicash agents.Irembo at all cells level or Irembo Agents. MTN Mobile Money, Airtel Money and Tigo Cash The payment for the group of people ( Serveral Households) is done via commercial banks and the list of people who the contributions are paid for must be submitted to the nearest RSSB Branch. that list must indicate ID number of the responsible person of each household. Here is the link: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "benefitAdvantage", "patterns": ["advantage of using Mutuelle de sante?", "what is the role healthcare benefit of using CBHI?", "how does Mutuelle de sante improve life of beneficiaries and people", "what about validity of The CBHI insurance scheme? when payment is done before 30th Semptembre?", "Mutuell de sante for people under age 18, who pay for their services"], "responses": [" A member of Community Based Health Insurance can get medical treatment cheaply at local medical facilities like health post or health centre and pays only 200Frw or just 10% of the total bill at all districts and provincial hospitals as well as referral hospitals. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "A member who joins for the first time the community based health insurance scheme shall starts benefiting from medical care services immediately if he/she has paid for the whole household before 30th September. When payment is done after 30th September they have to wait for one month after the payment of his/her subscription fees before benefiting. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "A member of Community Based Health Insurance does not become stranded at home because of quick access to health care, whenever need arises, before the sickness gets worse. A member of Community Based Health Insurance is assured of access to authorized medical facilities cheaply.Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme", " However, medical services for a child aged three (3) months and younger shall be covered by the child’s parents’ contribution. Payment of contribution is required for a child aged more than three (3) months. Here is the link: https://www.rssb.rw/scheme/cbhi-scheme", " A member of Community Based Health Insurance makes economic progress because of sustained health that enables a person to work hard to improve and maintain reasonable economic development and standard of living. Please note that medical care is refundable by RSSB provided that the health facility has signed an agreement with RSSB. The Ministry of Health in collaboration with RSSB has agreed which medical procedures and drugs are to be refunded.https://www.rssb.rw/scheme/cbhi-scheme", "The Community Based Health Insurance scheme offers healthcare coverage to household members if all of them have paid their respective contributions, with the exception of any member insured under any other medical insurance scheme. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme.", "The member renews his/her insurance before the benefiting year ends. However, he/she continue to receive medical care services for thirty days (30) upon expiry of the insurance. The community- based health insurance scheme year starts on 1st July and end on 30th June of the following year."]}, {"tag": "servicesOffered", "patterns": ["Health facilities opened to Community Based Health Insurance scheme affiliated members", "where do they find offered services?", "what are medical services covered by mutuelle", "Are drugs provided in health centres and hospitals?"], "responses": [" A member of Community Based Health Insurance can get medical treatment cheaply at local medical facilities like health post or health centre and pays only 200Frw or just 10% of the total bill at all districts and provincial hospitals as well as referral hospitals. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "Members of community based health insurance scheme receive primary medical care from health center or from a health post anywhere in the country. With exception of emergency cases, a patient benefits from medical care of health facilities of superior category if he or she has a transfer note. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "A member of Community Based Health Insurance does not become stranded at home because of quick access to health care, whenever need arises, before the sickness gets worse. A member of Community Based Health Insurance is assured of access to authorized medical facilities cheaply.Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme", " However, medical services for a child aged three (3) months and younger shall be covered by the child’s parents’ contribution. Payment of contribution is required for a child aged more than three (3) months. Here is the link: https://www.rssb.rw/scheme/cbhi-scheme", " A member of Community Based Health Insurance makes economic progress because of sustained health that enables a person to work hard to improve and maintain reasonable economic development and standard of living. Please note that medical care is refundable by RSSB provided that the health facility has signed an agreement with RSSB. The Ministry of Health in collaboration with RSSB has agreed which medical procedures and drugs are to be refunded.https://www.rssb.rw/scheme/cbhi-scheme", "The Community Based Health Insurance scheme offers healthcare coverage to household members if all of them have paid their respective contributions, with the exception of any member insured under any other medical insurance scheme. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme.", "The member renews his/her insurance before the benefiting year ends. However, he/she continue to receive medical care services for thirty days (30) upon expiry of the insurance. The community- based health insurance scheme year starts on 1st July and end on 30th June of the following year.Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "shazards", "patterns": ["what is occupational Hazards health insurance scheme?", "wwhat are the benefits of occupational insurances scheme? advantage", "where can we find categories of its benefits ", "Are drugs provided in health centres and hospitals?"], "responses": [" The temporary incapacity benefit is: 75% of average daily earnings in the last 3 months payable until full recovery or certificate of permanent incapacity for a maximum of 180 days.The permanent incapacity benefit is: a pension is payable of 85% of average monthly earnings in the last 3 months payable.Partial permanent incapacity benefit: is given according to the degree of incapacity in proportion to the pension the beneficiary would get if they had been permanently incapacitated. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "On satisfying the criteria to make a claim, the benefits cover you for:Free medical care.Daily sickness allowances. Incapacity social security benefits. Incapacity lump sum benefits.Survivors benefits. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "Occupational hazards is a scheme under RSSB which provides assistance to employees and employers in the risk of illnesses or accidents in the workplace. The benefits covered by RSSB under occupational hazard scheme are: Medical care, Daily sickness allowances, incapacity social security benefits and survivors' benefits. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme", " If the degree of the incapacity is at least 15% - the percentage of full pension according to the degree of incapacity.If the degree of the incapacity is less than 15% - then a lump sum payment equal to 3 years' pension according to the degree of incapacity is awarded to the beneficiary. Here is the link: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "claim", "patterns": ["I occupation hazards insurance scheme, how can I make a claim?", "I have a problem with my insurance What can I do?", "who can I ask about the issue with my insurance? "], "responses": ["The doctor should fill in the medical certificate of the first hand state of the injury sustained (A2).Ask the doctor to give RSSB a medical certificate of the prolongation of incapacity of injuries every 30 days. This prolongation must not exceed 150 days.You must equally inform your employer to give the RSSB a receipt of payment/non-payment.. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "Inform your employer and area labour inspector directly, as soon as possible.Give precisions relating to circumstances i.e. place of accident, eye witnesses, third party responsible for the accident. As soon as all information is received, the employer will fill the accident declaration (A1) in 6 copies. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "At the end of the treatment, ask your doctor to fill the certificate of healing and consolidation of injuries (A5).Keep careful the bills for medical treatment or food given by the hospital. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "EJOHEZA", "patterns": ["what is Ejo EJOHEZA", "what are the objectives of ejo heza?", "Can I know about Ejo heza and its objectives? "], "responses": ["The culture of saving among the citizen/residents in Rwanda.Universal access to pension and social security inclusion. Financial inclusion. Economic growth, poverty alleviation to attain higher standards of living. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "Long Term Saving Scheme (EJOHEZA) was established by the Government of Rwanda through the Ministry of Finance under the Law No 29/2017 of 29th June 2017. It is a defined contribution scheme, established on voluntary basis by opening a savings account with a scheme administrator, the Rwanda Social Security Board (RSSB), and covers both salaried and unsalaried people. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "Long Term Saving Scheme (EJOHEZA) was initated by: (1) self-employed individuals working in the informal sector who wish to save for the long-term (2) a salaried employed person regardless of their status as a member of any other social security scheme, who wants to save for the long term, (3) a member, who is no longer active, of a social security scheme to which he/she was affiliated but who receives benefits under the laws regulating that scheme, and who transfers them to a long-term savings account (4) a child below the age of sixteen (16) years benefiting from a long-term saving account opened by his/her parent or guardian and (5) any other person not included in the categories listed above. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "EJOHEZA", "patterns": ["what is Ejo EJOHEZA", "what are the objectives of ejo heza?", "Can I know about Ejo heza and its objectives? "], "responses": ["The culture of saving among the citizen/residents in Rwanda.Universal access to pension and social security inclusion. Financial inclusion. Economic growth, poverty alleviation to attain higher standards of living. See a link: https://www.rssb.rw/scheme/cbhi-scheme", "Long Term Saving Scheme (EJOHEZA) was established by the Government of Rwanda through the Ministry of Finance under the Law No 29/2017 of 29th June 2017. It is a defined contribution scheme, established on voluntary basis by opening a savings account with a scheme administrator, the Rwanda Social Security Board (RSSB), and covers both salaried and unsalaried people. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "Long Term Saving Scheme (EJOHEZA) was initated by: (1) self-employed individuals working in the informal sector who wish to save for the long-term (2) a salaried employed person regardless of their status as a member of any other social security scheme, who wants to save for the long term, (3) a member, who is no longer active, of a social security scheme to which he/she was affiliated but who receives benefits under the laws regulating that scheme, and who transfers them to a long-term savings account (4) a child below the age of sixteen (16) years benefiting from a long-term saving account opened by his/her parent or guardian and (5) any other person not included in the categories listed above. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "moreAboutEJOHEZAaccount", "patterns": ["what about EJOHEZA account opening?", " open an Ejo Heza account for for anyone including children aged less than 16 years?", "Can I know about Ejo heza and its objectives? "], "responses": ["Your EjoHeza account will be linked to your permanent national Identity Card (NID) number. Your national ID number will remain your unique link to your Ejo eza account for the rest of your life. Your EjoHeza account and your savings will always remain in your name even if you change your job or your home over time. If you are an adult and have a permanent national ID issued by NIDA, you can open your Ejo Heza account free of cost using your own mobile phone by simply dialing *506# for MTN Rwanda and Airtel-Tigo and by following the simple prompts for registration and payment of contributions. You can also open your own EjoHeza account free of cost using a web browser on a smart phone or a computer by visiting EjoHeza, clicking the “Register Now” button and following the simple prompts.", "Long Term Saving Scheme (EJOHEZA) was established by the Government of Rwanda through the Ministry of Finance under the Law No 29/2017 of 29th June 2017. It is a defined contribution scheme, established on voluntary basis by opening a savings account with a scheme administrator, the Rwanda Social Security Board (RSSB), and covers both salaried and unsalaried people. Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "To open your child's Ejo Heza account, you will need to personally visit an authorized Ejo Heza service provider with your child, submit your child's temporary ID issued by NIDA and link your child's Ejo Heza account to your own national ID number. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "whyAccountDiffRssb", "patterns": ["Why should a person who is already an RSSB Pension Scheme member also open an Ejo Heza account??", " what is the diffence and how does EjoHeza different from rssb?", "Are EjoHeza and Rssb the same? why one and another? "], "responses": ["Today, most people live for around 20 years after they are old (retirement age). So you should save as much as you can while you are working to ensure that you have enough savings to last you for at least 20 years of expenses when you retire. So even if you are already saving in the RSSB pension scheme, putting aside some additional savings into your Ejo Heza account will ensure that you have sufficient savings for a secure and dignified retirement and do not need to depend on others when you are old. Saving with Ejo Heza will also help you to accumulate savings for your other needs like children's education or housing.", " Ejo Heza is a voluntary, government-sponsored scheme available to all the citizens of Rwanda. Anyone working in the formal or informal sector, either self-employed or working for someone else, can join the scheme. The RSSB pension Scheme on the other hand is compulsory and is only available to those who are employed in public or private sector enterprises.  Link is here: https://www.rssb.rw/scheme/cbhi-scheme", "Ejo Heza is a defined contribution scheme whereas the RSSB pension scheme is a defined benefit scheme. Members in Ejo Heza will start receiving their monthly pension at 55 years of age whereas members in RSSB start receiving their monthly pension at 65 years or at early retirement of 60. RSSB contributions are a pre-defined percentage of salary and are deducted and remitted on a monthly basis. Ejo Heza members can decide how much they want to contribute and are also permitted to make contributions anytime (daily, weekly, monthly, quarterly or annually) as per their choice. Follow this link for more info: https://www.rssb.rw/scheme/cbhi-scheme"]}, {"tag": "troubleshooting internet", "patterns": ["Network is slow on my laptop", "I have slow internet on my phone", "my internet is not moving fast", "what can I do with internet connection ", "My network connection is bad"], "responses": ["The problem could be faulty wires or an overcrowded network. ", "Depending on your router, you will need to change channels or move the antennas around to see if it helps", "If your speed is still slow after testing your speed online, it’s best to speak with your ISP to confirm the issue or see if you need to change packages", "If your Wi-Fi speed is slow no matter where you are, try plugging a laptop into your modem directly and test your internet speed using a site like speedtest.net. If speeds are still down, the problem is likely with your internet connection, not your router. Contact your ISP.", "You can follow the same troubleshooting tips mentioned above for this problem. The problem could be faulty wires or an overcrowded network.Depending on your router, you will need to change channels or move the antennas around to see if it helps. Similar issues can also impair TV service without proper antenna installation.If your speed is still slow after testing your speed online, it’s best to speak with your ISP to confirm the issue or see if you need to change packages."]}]}